/*
题目描述
小明对数位中含有 2、0、1、9 的数字很感兴趣（不包括前导 0） ，在 1 到
40 中这样的数包括 1、2、9、10 至 32、39 和 40，共 28 个，他们的和是 574。
请问，在 1 到 n 中，所有这样的数的和是多少？
【输入格式】
输入一行包含两个整数 n。
【输出格式】
输出一行，包含一个整数，表示满足条件的数的和。
【样例输入】
40
【样例输出】
574
*/

#include<iostream>
using namespace std;

int main(){
	int n0,n1,n2,n3,n4,sum=0,num=0,N,Num=0;
	cin>>N;
	n0=N;
	while(n0){
		Num++;
		n0/=10;
	}
	//cout<<Num<<endl;
	for(int i=1;i<=N;i++){
		if(Num==4){
			if(i<10){
				n1=i%10;
				if(n1==0||n1==1||n1==2||n1==9){
					sum+=i; 
					num++;
				}
			}else if(i>=10&&i<100){
				n1=i/10%10;
				n2=i%10;
				if((n1==0||n1==1||n1==2||n1==9)||(n2==0||n2==1||n2==2||n2==9)){
					sum+=i; 
					num++;
				}
			}else if(i>=100&&i<1000){
				n1=i/100%10;
				n2=i/10%10;
				n3=i%10;
				if((n1==2||n1==0||n1==1||n1==9)||(n2==2||n2==0||n2==1||n2==9)||(n3==2||n3==0||n3==1||n3==9)){
					sum+=i; 
					num++;
				}
			}else {
				n1=i/1000%10;
				n2=i/100%10;
				n3=i/10%10;
				n4=i%10;
				if((n1==2||n1==0||n1==1||n1==9)||(n2==2||n2==0||n2==1||n2==9)||(n3==2||n3==0||n3==1||n3==9)||(n4==2||n4==0||n4==1||n4==9)){
					sum+=i; 
					num++;
				}
			}
			
		}
		else if(Num==3){
			if(i<10){
				n1=i%10;
				if(n1==0||n1==1||n1==2||n1==9){
					sum+=i; 
					num++;
				}
			}else if(i>=10&&i<100){
				n1=i/10%10;
				n2=i%10;
				if((n1==0||n1==1||n1==2||n1==9)||(n2==0||n2==1||n2==2||n2==9)){
					sum+=i; 
					num++;
				}
			}else{
				n1=i/100%10;
				n2=i/10%10;
				n3=i%10;
				if((n1==2||n1==0||n1==1||n1==9)||(n2==2||n2==0||n2==1||n2==9)||(n3==2||n3==0||n3==1||n3==9)){
					sum+=i; 
					num++;
				}
			}
			
		}
		else if(Num==2){
			if(i<10){
				n1=i%10;
				if(n1==0||n1==1||n1==2||n1==9){
					sum+=i; 
					num++;
				}
			}else{
				n1=i/10%10;
				n2=i%10;
				if((n1==0||n1==1||n1==2||n1==9)||(n2==0||n2==1||n2==2||n2==9)){
					sum+=i; 
					num++;
				}
			}
			
		}
		else if(Num==1){
			n1=i%10;
			if((n1==2||n1==0||n1==1||n1==9)){
				sum+=i; 
				num++;
			}
		}
	}
	cout<<sum<<endl;
}
